app/controllers/home_controller.rb

SELECT "hospitals".* FROM "hospitals"
---
  def index
    if params[:search].present?
      @hospitals = Hospital.where('name LIKE ?', "%#{params[:search]}%")
    else
      @hospitals = Hospital.all